In [37]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [38]:
df =pd.read_csv("C:\\Users\\akelo\\Desktop\\DATASETS\\course_lead_scoring.csv")

In [39]:
df.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NaN,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NaN,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1

In [40]:
df.columns = df.columns.str.strip().str.replace(' ','_',regex = True).str.lower()
categorical_columns = list(df.dtypes[df.dtypes == 'object'].index)
for c in categorical_columns:
    df[c] = df[c].str.lower().str.strip().str.replace(' ','_',regex = True)

In [41]:
df.dtypes

lead_source                  object
industry                     object
number_of_courses_viewed      int64
annual_income               float64
employment_status            object
location                     object
interaction_count             int64
lead_score                  float64
converted                     int64
dtype: object

In [42]:
df.columns

Index(['lead_source', 'industry', 'number_of_courses_viewed', 'annual_income',
       'employment_status', 'location', 'interaction_count', 'lead_score',
       'converted'],
      dtype='object')

In [43]:
categorical = [  'lead_source', 'industry',
       'employment_status', 'location']

In [44]:
numerical =['number_of_courses_viewed', 'annual_income',
       'interaction_count', 'lead_score','converted']

In [45]:
df.isnull().sum()

lead_source                 128
industry                    134
number_of_courses_viewed      0
annual_income               181
employment_status           100
location                     63
interaction_count             0
lead_score                    0
converted                     0
dtype: int64

In [46]:
df[[ 'lead_source', 'industry', 'employment_status', 'location']] = df [['lead_source', 'industry','employment_status', 'location']].astype('object')

In [47]:
df.dtypes

lead_source                  object
industry                     object
number_of_courses_viewed      int64
annual_income               float64
employment_status            object
location                     object
interaction_count             int64
lead_score                  float64
converted                     int64
dtype: object

In [48]:
df[[ 'lead_source', 'industry', 'employment_status', 'location']].isnull().sum()

lead_source          128
industry             134
employment_status    100
location              63
dtype: int64

In [49]:
df[df.select_dtypes(include = 'object').columns] = df.select_dtypes(include = 'object').fillna('NA')

In [50]:
df.select_dtypes(include = 'object').isnull().sum()

lead_source          0
industry             0
employment_status    0
location             0
dtype: int64

In [51]:
df[df.select_dtypes(include = ['int64','float64']).columns] = df.select_dtypes(include = ['float64','int64']).fillna(0)

In [52]:
df.select_dtypes(include = ['int64','float64']).isnull().sum()

number_of_courses_viewed    0
annual_income               0
interaction_count           0
lead_score                  0
converted                   0
dtype: int64

In [53]:
df['industry'].mode()

0    retail
Name: industry, dtype: object

In [54]:
#creating a correlation matrix for my numerical features
#But firstly we have to split our dataset
numerical

['number_of_courses_viewed',
 'annual_income',
 'interaction_count',
 'lead_score',
 'converted']

In [55]:
df[numerical]

,number_of_courses_viewed,annual_income,interaction_count,lead_score,converted
0,1,79450.0,4,0.94,1
1,1,46992.0,1,0.80,0
2,5,78796.0,3,0.69,1
3,2,83843.0,1,0.87,0
4,3,85012.0,3,0.62,1
...,...,...,...,...,...
1457,1,0.0,4,0.53,1
1458,3,65259.0,2,0.24,1
1459,1,45688.0,3,0.02,1
1460,5,71016.0,0,0.25,1
1461,3,92855.0,3,0.41,1

In [56]:
df.converted.head()

0    1
1    0
2    1
3    0
4    1
Name: converted, dtype: int64

In [57]:
from sklearn.model_selection import train_test_split

In [58]:
df_full_train,df_test = train_test_split(df,test_size =0.2,random_state = 1)

In [59]:
df_train,df_val = train_test_split(df_full_train,test_size =0.25,random_state = 1)

In [60]:
len(df_train),len(df_val),len(df_test)

(876, 293, 293)

In [61]:
len(df)

1462

In [62]:
y_full_train = df_full_train.converted.values
y_train =df_train.converted.values
y_val = df_val.converted.values
y_test = df_test.converted.values

In [63]:
idx = np.arange(len(df))

In [64]:
np.random.seed(42)
np.random.shuffle(idx)

In [65]:
df_full_train = df_full_train.reset_index(drop = True)
df_train =df_train.reset_index(drop = True)
df_test = df_test.reset_index(drop = True)
df_val =df_val.reset_index(drop = True)

In [66]:
df_train

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,events,manufacturing,2,95543.0,unemployed,europe,3,0.78,0
1,referral,NA,1,54924.0,student,south_america,6,0.39,1
2,organic_search,healthcare,2,77352.0,unemployed,europe,2,0.22,0
3,paid_ads,other,2,34600.0,employed,south_america,2,0.31,0
4,paid_ads,education,0,43615.0,unemployed,south_america,2,0.01,0
...,...,...,...,...,...,...,...,...,...
871,NA,other,5,67314.0,NA,europe,2,0.87,1
872,events,education,6,63996.0,NA,australia,4,0.92,1
873,organic_search,finance,1,73702.0,unemployed,north_america,2,0.55,0
874,events,technology,1,93341.0,student,middle_east,4,0.99,0
875,social_media,finance,0,0.0,unemployed,africa,3,0.73,0

In [67]:
df_val

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,organic_search,manufacturing,1,0.0,NA,asia,0,0.73,1
1,referral,education,2,58777.0,NA,north_america,0,0.94,1
2,paid_ads,technology,3,78148.0,employed,middle_east,2,0.80,1
3,social_media,technology,3,63854.0,employed,africa,1,0.10,0
4,referral,education,1,69099.0,unemployed,africa,4,0.98,1
...,...,...,...,...,...,...,...,...,...
288,paid_ads,finance,2,41947.0,self_employed,europe,4,0.10,1
289,paid_ads,other,2,0.0,self_employed,north_america,3,0.71,1
290,referral,NA,4,92215.0,employed,australia,4,0.57,1
291,events,other,2,53087.0,employed,europe,2,0.52,0
292,events,healthcare,3,60375.0,student,australia,9,0.30,1

In [68]:
df_test

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,organic_search,technology,1,0.0,employed,middle_east,2,0.90,0
1,paid_ads,finance,1,47129.0,NA,south_america,1,0.93,0
2,NA,education,0,0.0,unemployed,asia,5,0.97,1
3,events,retail,0,64775.0,self_employed,south_america,3,0.70,1
4,social_media,finance,3,46934.0,NA,australia,3,0.26,1
...,...,...,...,...,...,...,...,...,...
288,events,other,3,80326.0,self_employed,africa,6,0.27,1
289,referral,education,0,77641.0,student,europe,1,0.60,1
290,events,technology,1,70889.0,employed,asia,4,0.61,1
291,NA,other,2,57246.0,self_employed,asia,1,0.27,1
292,referral,healthcare,1,0.0,NA,asia,4,0.50,1

In [69]:
#del df_full_train['converted']
#del df_train['converted']
#del df_val['converted']
#del df_test['converted']

In [70]:
df_full_train.converted.value_counts(normalize = True)

converted
1    0.611634
0    0.388366
Name: proportion, dtype: float64

In [71]:
global_converted_rate = df_full_train.converted.mean()
global_converted_rate

np.float64(0.611633875106929)

In [72]:
df_full_train[numerical].corrwith(df_full_train.converted).abs()

number_of_courses_viewed    0.434872
annual_income               0.068845
interaction_count           0.387251
lead_score                  0.196394
converted                   1.000000
dtype: float64

In [73]:
#now i get working with mutual information score